zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_i2c.c
/*!
    \brief      disable SMBus alert (API_ID(0x002DU))
    \param[in]  i2c_periph: I2Cx(x=0)
    \param[out] none
    \retval     none
*/
void i2c_smbus_alert_disable(uint32_t i2c_periph)
{
    I2C_CTL0(i2c_periph) &= ~I2C_CTL0_SMBALTEN;
}

/*!
    \brief      enable SMBus device default address (API_ID(0x002EU))
    \param[in]  i2c_periph: I2Cx(x=0)
    \param[out] none
    \retval     none
*/
void i2c_smbus_default_addr_enable(uint32_t i2c_periph)
{
    I2C_CTL0(i2c_periph) |= I2C_CTL0_SMBDAEN;
}

/*!
    \brief      disable SMBus device default address (API_ID(0x002FU))
    \param[in]  i2c_periph: I2Cx(x=0)
    \param[out] none
    \retval     none
*/
void i2c_smbus_default_addr_disable(uint32_t i2c_periph)
{
    I2C_CTL0(i2c_periph) &= ~I2C_CTL0_SMBDAEN;
}

/*!
    \brief      enable SMBus host address (API_ID(0x0030U))
    \param[in]  i2c_periph: I2Cx(x=0)
    \param[out] none
    \retval     none
*/
void i2c_smbus_host_addr_enable(uint32_t i2c_periph)
{
    I2C_CTL0(i2c_periph) |= I2C_CTL0_SMBHAEN;
}

/*!
    \brief      disable SMBus host address (API_ID(0x0031U))
    \param[in]  i2c_periph: I2Cx(x=0)
    \param[out] none
    \retval     none
*/
void i2c_smbus_host_addr_disable(uint32_t i2c_periph)
{
    I2C_CTL0(i2c_periph) &= ~I2C_CTL0_SMBHAEN;
}

/*!
    \brief      enable extended clock timeout detection (API_ID(0x0032U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[out] none
    \retval     none
*/
void i2c_extended_clock_timeout_enable(uint32_t i2c_periph)
{
    I2C_TIMEOUT(i2c_periph) |= I2C_TIMEOUT_EXTOEN;
}

/*!
    \brief      disable extended clock timeout detection (API_ID(0x0033U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[out] none
    \retval     none
*/
void i2c_extended_clock_timeout_disable(uint32_t i2c_periph)
{
    I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_EXTOEN;
}

/*!
    \brief      enable clock timeout detection (API_ID(0x0034U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[out] none
    \retval     none
*/
void i2c_clock_timeout_enable(uint32_t i2c_periph)
{
    I2C_TIMEOUT(i2c_periph) |= I2C_TIMEOUT_TOEN;
}

/*!
    \brief      disable clock timeout detection (API_ID(0x0035U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[out] none
    \retval     none
*/
void i2c_clock_timeout_disable(uint32_t i2c_periph)
{
    I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_TOEN;
}

/*!
    \brief      configure bus timeout B (API_ID(0x0036U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  timeout: bus timeout B(0-0xfff)
    \param[out] none
    \retval     none
*/
void i2c_bus_timeout_b_config(uint32_t i2c_periph, uint32_t timeout)
{
    I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_BUSTOB;
    I2C_TIMEOUT(i2c_periph) |= (uint32_t)(timeout << TIMEOUT_BUSTOB_OFFSET) & I2C_TIMEOUT_BUSTOB;
}

/*!
    \brief      configure bus timeout A (API_ID(0x0037U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  timeout: bus timeout A(0-0xfff)
    \param[out] none
    \retval     none
*/
void i2c_bus_timeout_a_config(uint32_t i2c_periph, uint32_t timeout)
{
    I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_BUSTOA;
    I2C_TIMEOUT(i2c_periph) |= (uint32_t)(timeout & I2C_TIMEOUT_BUSTOA);
}

/*!
    \brief      configure idle clock timeout detection (API_ID(0x0038U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  timeout: Idle clock timeout detection content
                only one parameter can be selected which is shown as below:
      \arg        BUSTOA_DETECT_SCL_LOW: BUSTOA is used to detect SCL low timeout
      \arg        BUSTOA_DETECT_IDLE: BUSTOA is used to detect both SCL and SDA high timeout when the bus is idle
    \param[out] none
    \retval     none
*/
void i2c_idle_clock_timeout_config(uint32_t i2c_periph, uint32_t timeout)
{
    I2C_TIMEOUT(i2c_periph) &= ~I2C_TIMEOUT_TOIDLE;
    I2C_TIMEOUT(i2c_periph) |= timeout & I2C_TIMEOUT_TOIDLE;
}

/*!
    \brief      get I2C flag status (API_ID(0x0039U))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  flag: I2C flags
                only one parameter can be selected which is shown as below:
      \arg        I2C_FLAG_TBE: I2C_TDATA is empty during transmitting
      \arg        I2C_FLAG_TI: transmit interrupt
      \arg        I2C_FLAG_RBNE: I2C_RDATA is not empty during receiving
      \arg        I2C_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_FLAG_NACK: not acknowledge flag
      \arg        I2C_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_FLAG_TC: transfer complete in master mode
      \arg        I2C_FLAG_TCR: transfer complete reload
      \arg        I2C_FLAG_BERR: bus error
      \arg        I2C_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_FLAG_PECERR: PEC error
      \arg        I2C_FLAG_TIMEOUT: timeout flag
      \arg        I2C_FLAG_SMBALT: SMBus alert
      \arg        I2C_FLAG_I2CBSY: busy flag
      \arg        I2C_FLAG_TR: whether the I2C is a transmitter or a receiver in slave mode
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus i2c_flag_get(uint32_t i2c_periph, uint32_t flag)
{
    FlagStatus reval = RESET;

    if(0U != (I2C_STAT(i2c_periph) & flag)) {
        reval = SET;
    } else {
        /* do nothing */
    }

    return reval;
}

/*!
    \brief      clear I2C flag status (API_ID(0x003AU))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  flag: I2C flags
                one or more parameters can be selected which are shown as below:
      \arg        I2C_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_FLAG_NACK: not acknowledge flag
      \arg        I2C_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_FLAG_BERR: bus error
      \arg        I2C_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_FLAG_PECERR: PEC error
      \arg        I2C_FLAG_TIMEOUT: timeout flag
      \arg        I2C_FLAG_SMBALT: SMBus alert
    \param[out] none
    \retval     none
*/
void i2c_flag_clear(uint32_t i2c_periph, uint32_t flag)
{
    I2C_STATC(i2c_periph) |= (flag & I2C_STATC_MASK);
}

/*!
    \brief      enable I2C interrupt (API_ID(0x003BU))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  interrupt: I2C interrupts
                one or more parameters can be selected which are shown as below:
      \arg        I2C_INT_ERR: error interrupt
      \arg        I2C_INT_TC: transfer complete interrupt
      \arg        I2C_INT_STPDET: stop detection interrupt
      \arg        I2C_INT_NACK: not acknowledge received interrupt
      \arg        I2C_INT_ADDM: address match interrupt
      \arg        I2C_INT_RBNE: receive interrupt
      \arg        I2C_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_interrupt_enable(uint32_t i2c_periph, uint32_t interrupt)
{
    I2C_CTL0(i2c_periph) |= (interrupt & I2C_INT_EN_MASK);
}

/*!
    \brief      disable I2C interrupt (API_ID(0x003CU))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  interrupt: I2C interrupts
                one or more parameters can be selected which are shown as below:
      \arg        I2C_INT_ERR: error interrupt
      \arg        I2C_INT_TC: transfer complete interrupt
      \arg        I2C_INT_STPDET: stop detection interrupt
      \arg        I2C_INT_NACK: not acknowledge received interrupt
      \arg        I2C_INT_ADDM: address match interrupt
      \arg        I2C_INT_RBNE: receive interrupt
      \arg        I2C_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_interrupt_disable(uint32_t i2c_periph, uint32_t interrupt)
{
    I2C_CTL0(i2c_periph) &= ~(interrupt & I2C_INT_EN_MASK);
}

/*!
    \brief      get I2C interrupt flag status (API_ID(0x003DU))
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  int_flag: I2C interrupt flags, refer to i2c_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        I2C_INT_FLAG_TI: transmit interrupt flag
      \arg        I2C_INT_FLAG_RBNE: I2C_RDATA is not empty during receiving interrupt flag
      \arg        I2C_INT_FLAG_ADDSEND: address received matches in slave mode interrupt flag
      \arg        I2C_INT_FLAG_NACK: not acknowledge interrupt flag
      \arg        I2C_INT_FLAG_STPDET: stop condition detected in slave mode interrupt flag
      \arg        I2C_INT_FLAG_TC: transfer complete in master mode interrupt flag
      \arg        I2C_INT_FLAG_TCR: transfer complete reload interrupt flag
      \arg        I2C_INT_FLAG_BERR: bus error interrupt flag
      \arg        I2C_INT_FLAG_LOSTARB: arbitration lost interrupt flag
      \arg        I2C_INT_FLAG_OUERR: overrun/underrun error in slave mode interrupt flag
      \arg        I2C_INT_FLAG_PECERR: PEC error interrupt flag
      \arg        I2C_INT_FLAG_TIMEOUT: timeout interrupt flag
      \arg        I2C_INT_FLAG_SMBALT: SMBus Alert interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus i2c_interrupt_flag_get(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag)
{
    FlagStatus reval = RESET;
    uint32_t ret1;
    uint32_t ret2;

